#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_cosmosdb_account.ngc will be created
  + resource "azurerm_cosmosdb_account" "ngc" {
      + connection_strings                = (sensitive value)
      + enable_automatic_failover         = false
      + enable_multiple_write_locations   = false
      + endpoint                          = (known after apply)
      + id                                = (known after apply)
      + is_virtual_network_filter_enabled = false
      + kind                              = "GlobalDocumentDB"
      + location                          = "northeurope"
      + name                              = "nextgenconf"
      + offer_type                        = "Standard"
      + primary_master_key                = (sensitive value)
      + primary_readonly_master_key       = (sensitive value)
      + read_endpoints                    = (known after apply)
      + resource_group_name               = "ngc"
      + secondary_master_key              = (sensitive value)
      + secondary_readonly_master_key     = (sensitive value)
      + tags                              = (known after apply)
      + write_endpoints                   = (known after apply)

      + consistency_policy {
          + consistency_level       = "BoundedStaleness"
          + max_interval_in_seconds = 10
          + max_staleness_prefix    = 200
        }

      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "northeurope"
        }
      + geo_location {
          + failover_priority = 1
          + id                = (known after apply)
          + location          = "westeurope"
        }
    }

  # azurerm_cosmosdb_mongo_collection.ngc will be created
  + resource "azurerm_cosmosdb_mongo_collection" "ngc" {
      + account_name        = "nextgenconf"
      + database_name       = "SessionsDb"
      + default_ttl_seconds = -1
      + id                  = (known after apply)
      + name                = "Sessions"
      + resource_group_name = "ngc"
      + shard_key           = "_id"
      + throughput          = 400
    }

  # azurerm_cosmosdb_mongo_database.ngc_sessions will be created
  + resource "azurerm_cosmosdb_mongo_database" "ngc_sessions" {
      + account_name        = "nextgenconf"
      + id                  = (known after apply)
      + name                = "SessionsDb"
      + resource_group_name = "ngc"
    }

  # github_repository.repository_api_gateway will be updated in-place
  ~ resource "github_repository" "repository_api_gateway" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        default_branch     = "master"
        description        = "Microservice for aggregating requests to storage services"
        etag               = "W/\"359e323b99bb8e0e0e5946b7e7edf275\""
        full_name          = "NextGenConf/ApiGateway"
        git_clone_url      = "git://github.com/NextGenConf/ApiGateway.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/ApiGateway"
        http_clone_url     = "https://github.com/NextGenConf/ApiGateway.git"
        id                 = "ApiGateway"
        license_template   = "mit"
        name               = "ApiGateway"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/ApiGateway.git"
        svn_url            = "https://github.com/NextGenConf/ApiGateway"
      - topics             = [] -> null
    }

  # github_repository.repository_conference_service will be updated in-place
  ~ resource "github_repository" "repository_conference_service" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        auto_init          = false
        default_branch     = "master"
        description        = "Microservice for storing conferences"
        etag               = "W/\"ce2e3f47d3717c5f17e6828bc4f9f3b6\""
        full_name          = "NextGenConf/ConferenceService"
        git_clone_url      = "git://github.com/NextGenConf/ConferenceService.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/ConferenceService"
        http_clone_url     = "https://github.com/NextGenConf/ConferenceService.git"
        id                 = "ConferenceService"
        name               = "ConferenceService"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/ConferenceService.git"
        svn_url            = "https://github.com/NextGenConf/ConferenceService"
      - topics             = [] -> null
    }

  # github_repository.repository_conference_session_service will be updated in-place
  ~ resource "github_repository" "repository_conference_session_service" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        default_branch     = "master"
        description        = "Microservice for storing the relationship between conferences and sessions"
        etag               = "W/\"781d807b22c2ea5593521dc06951cea0\""
        full_name          = "NextGenConf/ConferenceSessionService"
        git_clone_url      = "git://github.com/NextGenConf/ConferenceSessionService.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/ConferenceSessionService"
        http_clone_url     = "https://github.com/NextGenConf/ConferenceSessionService.git"
        id                 = "ConferenceSessionService"
        license_template   = "mit"
        name               = "ConferenceSessionService"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/ConferenceSessionService.git"
        svn_url            = "https://github.com/NextGenConf/ConferenceSessionService"
      - topics             = [] -> null
    }

  # github_repository.repository_feed_service will be updated in-place
  ~ resource "github_repository" "repository_feed_service" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        default_branch     = "master"
        description        = "Microservice for storing conference feeds"
        etag               = "W/\"803a30316b17f3563f740f5488e15189\""
        full_name          = "NextGenConf/FeedService"
        git_clone_url      = "git://github.com/NextGenConf/FeedService.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/FeedService"
        http_clone_url     = "https://github.com/NextGenConf/FeedService.git"
        id                 = "FeedService"
        license_template   = "mit"
        name               = "FeedService"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/FeedService.git"
        svn_url            = "https://github.com/NextGenConf/FeedService"
      - topics             = [] -> null
    }

  # github_repository.repository_k8s_config will be updated in-place
  ~ resource "github_repository" "repository_k8s_config" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        default_branch     = "master"
        description        = "Repository containing the kubernetes resource files for the NextGenConf cluster"
        etag               = "W/\"18c306cdc14b3b6996254621de51d7a1\""
        full_name          = "NextGenConf/KubeConfig"
        git_clone_url      = "git://github.com/NextGenConf/KubeConfig.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/KubeConfig"
        http_clone_url     = "https://github.com/NextGenConf/KubeConfig.git"
        id                 = "KubeConfig"
        license_template   = "mit"
        name               = "KubeConfig"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/KubeConfig.git"
        svn_url            = "https://github.com/NextGenConf/KubeConfig"
    }

  # github_repository.repository_session_service will be updated in-place
  ~ resource "github_repository" "repository_session_service" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        default_branch     = "master"
        description        = "Microservice for storing conference sessions"
        etag               = "W/\"d6570fe04da9c6cf97b56c5a27cae0bf\""
        full_name          = "NextGenConf/SessionService"
        git_clone_url      = "git://github.com/NextGenConf/SessionService.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/SessionService"
        http_clone_url     = "https://github.com/NextGenConf/SessionService.git"
        id                 = "SessionService"
        license_template   = "mit"
        name               = "SessionService"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/SessionService.git"
        svn_url            = "https://github.com/NextGenConf/SessionService"
      - topics             = [] -> null
    }

  # github_repository.repository_web_app will be updated in-place
  ~ resource "github_repository" "repository_web_app" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        auto_init          = false
        default_branch     = "master"
        description        = "React app displaying conferences"
        etag               = "W/\"605ea20d2bcac4a782ef6ec028726e51\""
        full_name          = "NextGenConf/WebApp"
        git_clone_url      = "git://github.com/NextGenConf/WebApp.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/WebApp"
        http_clone_url     = "https://github.com/NextGenConf/WebApp.git"
        id                 = "WebApp"
        name               = "WebApp"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/WebApp.git"
        svn_url            = "https://github.com/NextGenConf/WebApp"
      - topics             = [] -> null
    }

Plan: 3 to add, 7 to change, 0 to destroy.
```

</details>

*Workflow: `ci pr`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
